In [1]:
#import 
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
#create new series 
ser1 = Series(np.arange(3),index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int64

In [3]:
#dropping index
ser1.drop('b')
ser1

a    0
b    1
c    2
dtype: int64

In [4]:
#dropping from DataFrame
#create dataframe
dFrame1 = DataFrame(np.arange(9).reshape((3,3)),index=['SF','LA','NY'],columns=['pop','size','year'])
dFrame1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [5]:
#drop row - it doesnt do it permenantly
dFrame1.drop('LA')

    pop  size  year
SF    0     1     2
NY    6     7     8

In [6]:
dFrame1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [7]:
#to permanently drop it you need to create new Dataframe
dFrame2 = dFrame1.drop('LA')

In [8]:
dFrame2

    pop  size  year
SF    0     1     2
NY    6     7     8

In [10]:
#drop column
dFrame1.drop('year',axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7